In [68]:
import pandas as pd

file_path = 'C:\\Users\\Venkata Sai\\Desktop\\PYTHON\\UPX_LMS\\'
xl_file_sheet_name = pd.read_excel(file_path+'obes-phys-acti-diet.xls','7.1')#pd.read_excel(filename, worksheetname)

print(xl_file_sheet_name.head())

  Table 7.1 Finished Admission Episodes with a primary diagnosis of obesity, by gender, 2000/01 to 2011/12  \
0                                                NaN
1                                                NaN
2                                            England
3                                                NaN
4                                                NaN

  Unnamed: 1 Unnamed: 2 Unnamed: 3  Unnamed: 4  Back to contents
0        NaN        NaN        NaN         NaN               NaN
1        NaN        NaN        NaN         NaN               NaN
2        NaN        NaN    Numbers         NaN               NaN
3      Total      Males    Females         NaN               NaN
4        NaN        NaN        NaN         NaN               NaN

In [40]:
# Define a dictionary containing employee data 
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [33]:
# select two columns 
df[['Name', 'Qualification']]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [51]:
df[df.columns[1:3]]
df
#select three rows and two columns 
df.loc[1:3, ['Name', 'Qualification']]

     Name Qualification
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [49]:
df.loc[0:1] # display the number of rows

     Name  Age Address Qualification
0     Jai   27   Delhi           Msc
1  Princi   24  Kanpur            MA

In [61]:
df.loc[0:2, ['Name','Qualification']] # select the number of rows with columns

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA

In [63]:
df.loc[0,:]

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

In [67]:
df.iloc [0:2, 0:2] # its allows only numbers

     Name  Age
0     Jai   27
1  Princi   24

In [69]:
# Define a dictionary containing ICC rankings 
rankings = {'test': ['India', 'South Africa', 'England', 
                            'New Zealand', 'Australia'], 
              'odi': ['England', 'India', 'New Zealand', 
                            'South Africa', 'Pakistan'], 
               't20': ['Pakistan', 'India', 'Australia', 
                              'England', 'New Zealand']} 
   
# Convert the dictionary into DataFrame 
rankings_pd = pd.DataFrame(rankings) 
   
# Before renaming the columns 
print(rankings_pd)

           test           odi          t20
0         India       England     Pakistan
1  South Africa         India        India
2       England   New Zealand    Australia
3   New Zealand  South Africa      England
4     Australia      Pakistan  New Zealand

In [70]:
# After renaming the columns 
rankings_pd.rename(columns={'test':'Test','odi':'OneDayInternaitonal'})

           Test OneDayInternaitonal          t20
0         India             England     Pakistan
1  South Africa               India        India
2       England         New Zealand    Australia
3   New Zealand        South Africa      England
4     Australia            Pakistan  New Zealand

In [71]:
# importing pandas as pd 
import pandas as pd 
  
# sample dataframe 
df = pd.DataFrame({'A': ['foo', 'bar', 'g2g', 'g2g', 'g2g', 
                         'bar', 'bar', 'foo', 'bar'], 
                  'B': ['a', 'b', 'a', 'b', 'b', 'b', 'a', 'a', 'b'] }) 
df

     A  B
0  foo  a
1  bar  b
2  g2g  a
3  g2g  b
4  g2g  b
5  bar  b
6  bar  a
7  foo  a
8  bar  b

In [73]:
#frequency of count of columns
count = df['A'].value_counts()
count

bar    4
g2g    3
foo    2
Name: A, dtype: int64

In [76]:
df.get_values()

array([['foo', 'a'],
       ['bar', 'b'],
       ['g2g', 'a'],
       ['g2g', 'b'],
       ['g2g', 'b'],
       ['bar', 'b'],
       ['bar', 'a'],
       ['foo', 'a'],
       ['bar', 'b']], dtype=object)

In [91]:
f = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
index=['cobra', 'viper', 'sidewinder'],
columns=['max_speed', 'shield'])

df = pd.DataFrame(f)
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [79]:
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [83]:
df.loc[['cobra','sidewinder']]

            max_speed  shield
cobra               1       2
sidewinder          7       8

In [87]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [88]:
df.loc['cobra', 'shield']

2

In [94]:
df.loc['viper','shield']

5

In [95]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [98]:
df.loc['viper','shield']

5

In [99]:
df['shield']>6

cobra         False
viper         False
sidewinder     True
Name: shield, dtype: bool

In [100]:
df.loc[df['shield']>6]

            max_speed  shield
sidewinder          7       8

In [101]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [102]:
#set the calue of entire row

df.loc['cobra'] = 10

In [103]:
df

            max_speed  shield
cobra              10      10
viper               4       5
sidewinder          7       8

In [104]:
df.loc['max_speed'] = 20

In [108]:
df

            max_speed  shield
cobra              10      10
viper               4       5
sidewinder          7       8
max_speed          20      20

In [110]:
df.drop('max_speed')

            max_speed  shield
cobra              10      10
viper               4       5
sidewinder          7       8

In [111]:
df.loc[:,'max_speed'] = 30

In [112]:
df

            max_speed  shield
cobra              30      10
viper              30       5
sidewinder         30       8
max_speed          30      20

In [120]:
f = pd.DataFrame([[1, 2,3], [4, 5,7], [7, 8,9]],
index=['cobra', 'viper', 'sidewinder'],
columns=['max_speed', 'shield','range'])

df = pd.DataFrame(f)

df

            max_speed  shield  range
cobra               1       2      3
viper               4       5      7
sidewinder          7       8      9

In [114]:
df.loc['cobra']

max_speed    1
shield       2
Name: cobra, dtype: int64

In [116]:
df.loc['viper':'sidewinder']

            max_speed  shield
viper               4       5
sidewinder          7       8

In [118]:
df.loc['viper','max_speed']

4

In [119]:
df.loc['viper':'sidewinder','max_speed']

viper         4
sidewinder    7
Name: max_speed, dtype: int64

In [122]:
df.loc['cobra':'viper','max_speed':'range']

       max_speed  shield  range
cobra          1       2      3
viper          4       5      7

In [126]:
df

            max_speed  shield  range
cobra               1       2      3
viper               4       5      7
sidewinder          7       8      9

In [127]:
df.loc[:,'max_speed']>6

cobra         False
viper         False
sidewinder     True
Name: max_speed, dtype: bool

In [128]:
df[df.loc[:,'max_speed']>6]

            max_speed  shield  range
sidewinder          7       8      9

In [130]:
df['shield']

cobra         2
viper         5
sidewinder    8
Name: shield, dtype: int64

In [131]:
df['shield']>6

cobra         False
viper         False
sidewinder     True
Name: shield, dtype: bool

In [133]:
df.loc[df['shield']>2]

            max_speed  shield  range
viper               4       5      7
sidewinder          7       8      9

In [135]:
df.loc[df['shield']>6,['max_speed']]

            max_speed
sidewinder          7

In [136]:
df['shield']

cobra         2
viper         5
sidewinder    8
Name: shield, dtype: int64

In [137]:
df['shield'] = 30

In [138]:
df

            max_speed  shield  range
cobra               1      30      3
viper               4      30      7
sidewinder          7      30      9

In [141]:
df.loc[['viper'],['shield']]=50

In [142]:
df

            max_speed  shield  range
cobra               1      30      3
viper               4      50      7
sidewinder          7      30      9

In [144]:
df.loc[['cobra','sidewinder'],['range']]= 50

In [145]:
df

            max_speed  shield  range
cobra               1      30     50
viper               4      50      7
sidewinder          7      30     50

In [146]:
# importing pandas as pd 
import pandas as pd 
  
# Creating the DataFrame 
df = pd.DataFrame({"A":[12, 4, 5, None, 1],  
                   "B":[7, 2, 54, 3, None],  
                   "C":[20, 16, 11, 3, 8],  
                   "D":[14, 3, None, 2, 6]})  
  
# Create the index 
new_index = ['Row_1', 'Row_2', 'Row_3', 'Row_4', 'Row_5'] 
  
# Set the index 
df.index = new_index 
  
# Print the DataFrame 
print(df)

          A     B   C     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0

In [147]:
# to select only particular columns
df.loc[:,['A','B']]

          A     B
Row_1  12.0   7.0
Row_2   4.0   2.0
Row_3   5.0  54.0
Row_4   NaN   3.0
Row_5   1.0   NaN

In [148]:
df.loc['B'] = 30

In [149]:
df

          A     B   C     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0
B      30.0  30.0  30  30.0

In [150]:
df.drop('B')

          A     B   C     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0

In [155]:
df

          A     B   C     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0
B      30.0  30.0  30  30.0

In [158]:
df.drop('B',inplace=True)

In [159]:
df

          A     B   C     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0

In [161]:
# Declare a list that is to be converted into a column 
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna','Tets'] 
  
# Using 'Address' as the column name 
# and equating it to the list 
df['Address'] = address

In [164]:
df.drop('Address',axis=1)

          A     B   C     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0

In [165]:
ddf

NameError: name 'ddf' is not defined

In [167]:
df.drop('Address',axis =1, inplace =True)

In [168]:
df

          A     B   C     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0

In [169]:
E = [10,20,30,40,50]
df['E'] = E

In [170]:
df

          A     B   C     D   E
Row_1  12.0   7.0  20  14.0  10
Row_2   4.0   2.0  16   3.0  20
Row_3   5.0  54.0  11   NaN  30
Row_4   NaN   3.0   3   2.0  40
Row_5   1.0   NaN   8   6.0  50

In [171]:
df.insert(0,'A1',[1,2,3,4,5])

In [172]:
df

       A1     A     B   C     D   E
Row_1   1  12.0   7.0  20  14.0  10
Row_2   2   4.0   2.0  16   3.0  20
Row_3   3   5.0  54.0  11   NaN  30
Row_4   4   NaN   3.0   3   2.0  40
Row_5   5   1.0   NaN   8   6.0  50